Revit 2026 API

# ShellLayerType Enumeration

---

Used to distinguish exterior and interior shell layers.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ShellLayerType
```
```vb
Public Enumeration ShellLayerType
```
```cpp
public enum class ShellLayerType
```
```fsharp
type ShellLayerType
```

| Member name | Value | Description |
| --- | --- | --- |
| Exterior | 1 | Exterior shell layer. |
| Interior | 0 | Interior shell layer. |

Used as an argument to methods of CompoundStructure that deal with shell layers.

#### Reference

Autodesk.Revit.DB Namespace